{
  "openapiDirectoryPath": "billbee.io/v1/openapi.yaml",
  "providerName": "billbee.io",
  "openApiRaw": "https://app.billbee.io/swagger/docs/v1",
  "securitySchemes": {
    "X-Billbee-Api-Key": {
      "description": "To identify the app developer, each API request has do contain a valid API Key in the HTTP header X-Billbee-Api-Key.",
      "in": "header",
      "name": "X-Billbee-Api-Key",
      "type": "apiKey"
    },
    "basic": {
      "description": "To authenticate an API request, the Billbee username/email and an API password have to be provided as a BasicAuth header.",
      "scheme": "basic",
      "type": "http"
    }
  },
  "categories": [
    "ecommerce"
  ],
  "homepage": "billbee.io",
  "apiVersion": "v1",
  "apiBaseUrl": "https://app.billbee.io",
  "apiDescription": "Documentation of the Billbee REST API to connect a Billbee account to external aplications.\n\n## Endpoint\n\nThe Billbee API endpoint base url is https://api.billbee.io/api/v1 \n\n## Activation\n\nYou have to enable the API in the settings of your Billbee account. In addition you need a Billbee API Key identifying the application you develop. To get an API key, send a mail to support@billbee.io and send us a short note about what you are building.\n\n## Authorization & security\n\nBecause you can access private data with the Billbee API, every request has to be sent over https and must\n\n* Contain a valid API Key identifying the application/developer. It has to be sent as the HTTP header X-Billbee-Api-Key\n* Contain a valid user login with billbee username and api password in form of a basic auth HTTP header\n\n## Throttling\n\nEach endpoint has a throttle of max 2 requests per second per combination of API Key and Billbee user.\n\nWhen you exceed these 2 calls, the API will return a HTTP 429 status code\n\n",
  "apiTitle": "Billbee API",
  "endpoints": 55,
  "sdkMethods": 76,
  "schemas": 94,
  "parameters": 437,
  "contactUrl": "https://www.billbee.io",
  "contactEmail": "support@billbee.io",
  "difficultyScore": 232.25,
  "difficulty": "Hard"
}