{
  "providerName": "ebay.com",
  "openApiRaw": "https://developer.ebay.com/api-docs/master/sell/logistics/openapi/3/sell_logistics_v1_oas3.json",
  "securitySchemes": {
    "api_auth": {
      "description": "The security definitions for this API. Please check individual operations for applicable scopes.",
      "flows": {
        "authorizationCode": {
          "authorizationUrl": "https://auth.ebay.com/oauth2/authorize",
          "scopes": {
            "https://api.ebay.com/oauth/api_scope/sell.logistics": " This scope would allow signed in user to access Logistics information."
          },
          "tokenUrl": "https://api.ebay.com/identity/v1/oauth2/token"
        }
      },
      "type": "oauth2"
    }
  },
  "categories": [
    "ecommerce"
  ],
  "homepage": "ebay.com",
  "serviceName": "sell-logistics",
  "apiVersion": "v1_beta.0.0",
  "methods": [
    {
      "url": "/shipment/create_from_shipping_quote",
      "method": "createFromShippingQuote",
      "httpMethod": "post",
      "tag": "shipment",
      "typeScriptTag": "shipment",
      "description": "This method creates a \"shipment\" based on the <b>shippingQuoteId</b> and <b>rateId</b> values supplied in the request. The rate identified by the <b>rateId</b> value specifies the carrier and service for the package shipment, and the rate ID must be contained in the shipping quote identified by the <b>shippingQuoteId</b> value. Call <b>createShippingQuote</b> to retrieve a set of live shipping rates.  <br><br>When you create a shipment, eBay generates a shipping label that you can download and use to ship your package.  <br><br>In a <b>createFromShippingQuote</b> request, sellers can include a list of shipping options they want to add to the base service quoted in the selected rate. The list of available shipping options is specific to each quoted rate and if available, the options are listed in the rate container of the of the shipping quote.  <br><br>In addition to a configurable return-to location and other details about the shipment, the response to this method includes:  <ul><li>The shipping carrier and service to be used for the package shipment</li> <li>A list of selected shipping options, if any</li> <li>The shipment tracking number</li> <li>The total shipping cost (the sum cost of the base shipping service and any added options)</li></ul> When you create a shipment, your billing agreement account is charged the sum of the <b>baseShippingCost</b> and the total cost of any additional shipping options you might have selected. Use the URL returned in <b>labelDownloadUrl</b> field, or call <b>downloadLabelFile</b> with the <b>shipmentId</b> value from the response, to download a shipping label for your package. <p class=\"tablenote\"><b>Important!</b> Sellers must set up their payment method with eBay before they can use this method to create a shipment and the associated shipping label.</p>",
      "parameters": [
        {
          "name": "additionalOptions",
          "schema": "array",
          "description": ""
        },
        {
          "name": "labelCustomMessage",
          "schema": "string",
          "description": ""
        },
        {
          "name": "labelSize",
          "schema": "string",
          "description": ""
        },
        {
          "name": "rateId",
          "schema": "string",
          "description": ""
        },
        {
          "name": "returnTo",
          "schema": "object",
          "description": ""
        },
        {
          "name": "shippingQuoteId",
          "schema": "string",
          "description": ""
        }
      ],
      "responses": [
        {
          "statusCode": "201",
          "description": "This complex type defines a shipment for a specific package (for example, a box or letter). Shipments are always linked to a purchased shipping label. "
        }
      ]
    },
    {
      "url": "/shipment/{shipmentId}",
      "method": "getShipment",
      "httpMethod": "get",
      "tag": "shipment",
      "typeScriptTag": "shipment",
      "description": "This method retrieves the shipment details for the specified shipment ID. Call <b>createFromShippingQuote</b> to generate a shipment ID.",
      "parameters": [
        {
          "name": "shipmentId",
          "schema": "string",
          "required": true,
          "description": "This path parameter specifies the unique eBay-assigned ID of the shipment you want to retrieve. The <b>shipmentId</b> value is generated and returned by a call to <b>createFromShippingQuote</b>."
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": "This complex type defines a shipment for a specific package (for example, a box or letter). Shipments are always linked to a purchased shipping label. "
        }
      ]
    },
    {
      "url": "/shipment/{shipmentId}/cancel",
      "method": "cancelShipment",
      "httpMethod": "post",
      "tag": "shipment",
      "typeScriptTag": "shipment",
      "description": "This method cancels the shipment associated with the specified shipment ID and the associated shipping label is deleted. When you cancel a shipment, the <b>totalShippingCost</b> of the canceled shipment is refunded to the account established by the user's billing agreement.  <br><br>Note that you cannot cancel a shipment if you have used the associated shipping label.",
      "parameters": [
        {
          "name": "shipmentId",
          "schema": "string",
          "required": true,
          "description": "This path parameter specifies the unique eBay-assigned ID of the shipment to be canceled. The <b>shipmentId</b> value is generated and returned by a call to <b>createFromShippingQuote</b>."
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": "This complex type defines a shipment for a specific package (for example, a box or letter). Shipments are always linked to a purchased shipping label. "
        }
      ]
    },
    {
      "url": "/shipment/{shipmentId}/download_label_file",
      "method": "downloadLabelFile",
      "httpMethod": "get",
      "tag": "shipment",
      "typeScriptTag": "shipment",
      "description": "This method returns the shipping label file that was generated for the <b>shipmentId</b> value specified in the request. Call <b>createFromShippingQuote</b> to generate a shipment ID.  <br><br>Use the <code>Accept</code> HTTP header to specify the format of the returned file. The default file format is a PDF file. <!-- Are other options available? -->",
      "parameters": [
        {
          "name": "shipmentId",
          "schema": "string",
          "required": true,
          "description": "This path parameter specifies the unique eBay-assigned ID of the shipment associated with the shipping label you want to download. The <b>shipmentId</b> value is generated and returned by a call to <b>createFromShippingQuote</b>."
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": ""
        }
      ]
    },
    {
      "url": "/shipping_quote",
      "method": "createShippingQuote",
      "httpMethod": "post",
      "tag": "shipping_quote",
      "typeScriptTag": "shippingQuote",
      "description": "The <b>createShippingQuote</b> method returns a <i>shipping quote </i> that contains a list of live \"rates.\"  <br><br>Each rate represents an offer made by a shipping carrier for a specific service and each offer has a live quote for the base service cost. Rates have a time window in which they are \"live,\" and rates expire when their purchase window ends. If offered by the carrier, rates can include shipping options (and their associated prices), and users can add any offered shipping option to the base service should they desire.  Also, depending on the services required, rates can also include pickup and delivery windows.  <br><br>Each rate is for a single package and is based on the following information: <ul><li>The shipping origin</li> <li>The shipping destination</li> <li>The package size (weight and dimensions)</li></ul>  Rates are identified by a unique eBay-assigned <b>rateId</b> and rates are based on price points, pickup and delivery time frames, and other user requirements. Because each rate offered must be compliant with the eBay shipping program, all rates reflect eBay-negotiated prices.  <br><br>The various rates returned in a shipping quote offer the user a choice from which they can choose a shipping service that best fits their needs. Select the rate for your shipment and using the associated <b>rateId</b>, call <b>createFromShippingQuote</b> to create a shipment and generate a shipping label that you can use to ship the package.",
      "parameters": [
        {
          "name": "xEbayCMarketplaceId",
          "schema": "string",
          "required": true,
          "description": "This header parameter specifies the eBay marketplace for the shipping quote that is being created. For a list of valid values, refer to the section <a href=\"/api-docs/static/rest-request-components.html#marketpl\" target=\"_blank\">Marketplace ID Values</a> in the <b>Using eBay RESTful APIs</b> guide."
        },
        {
          "name": "orders",
          "schema": "array",
          "description": ""
        },
        {
          "name": "packageSpecification",
          "schema": "object",
          "description": ""
        },
        {
          "name": "shipFrom",
          "schema": "object",
          "description": ""
        },
        {
          "name": "shipTo",
          "schema": "object",
          "description": ""
        }
      ],
      "responses": [
        {
          "statusCode": "201",
          "description": "This complex type describes a \"shipping quote,\" which contains the parameters for a package shipment. The shipping quote contains a list of \"live quotes\" or <i>rates</i> for the shipment. Rates are offerd by a carrier for a particular service, of set of services, for shipping the package. Included in the shipping quote are the package specifications, the shipment's origin and destination addresses, and the shipping parameters specified by the seller.  <br><br>Use the <b>rateId</b> value to select the specific service you want when you create a shipment by calling <b>createFromShippingQuote</b>."
        }
      ]
    },
    {
      "url": "/shipping_quote/{shippingQuoteId}",
      "method": "getShippingQuote",
      "httpMethod": "get",
      "tag": "shipping_quote",
      "typeScriptTag": "shippingQuote",
      "description": "This method retrieves the complete details of the shipping quote associated with the specified <b>shippingQuoteId</b> value.  <br><br>A \"shipping quote\" pertains to a single specific package and contains a set of shipping \"rates\" that quote the cost to ship the package by different shipping carriers and services. The quotes are based on the package's origin, destination, and size.  <br><br>Call <b>createShippingQuote</b> to create a <b>shippingQuoteId</b>.",
      "parameters": [
        {
          "name": "shippingQuoteId",
          "schema": "string",
          "required": true,
          "description": "This path parameter specifies the unique eBay-assigned ID of the shipping quote you want to retrieve. The <b>shippingQuoteId</b> value is generated and returned by a call to <b>createShippingQuote</b>."
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": "This complex type describes a \"shipping quote,\" which contains the parameters for a package shipment. The shipping quote contains a list of \"live quotes\" or <i>rates</i> for the shipment. Rates are offerd by a carrier for a particular service, of set of services, for shipping the package. Included in the shipping quote are the package specifications, the shipment's origin and destination addresses, and the shipping parameters specified by the seller.  <br><br>Use the <b>rateId</b> value to select the specific service you want when you create a shipment by calling <b>createFromShippingQuote</b>."
        }
      ]
    }
  ],
  "apiBaseUrl": "https://api.ebay.com{basePath}",
  "apiDescription": "<span class=\"tablenote\"><b>Note:</b> This is a <a href=\"https://developer.ebay.com/api-docs/static/versioning.html#limited\" target=\"_blank\"> <img src=\"/cms/img/docs/partners-api.svg\" class=\"legend-icon partners-icon\" title=\"Limited Release\"  alt=\"Limited Release\" />(Limited Release)</a> API available only to select developers approved by business units.</span><br /><br />The <b>Logistics API</b> resources offer the following capabilities: <ul><li><b>shipping_quote</b> &ndash; Consolidates into a list a set of live shipping rates, or quotes, from which you can select a rate to ship a package.</li> <li><b>shipment</b> &ndash; Creates a \"shipment\" for the selected shipping rate.</li></ul> Call <b>createShippingQuote</b> to get a list of live shipping rates. The rates returned are all valid for a specific time window and all quoted prices are at eBay-negotiated rates. <br><br>Select one of the live rates and using its associated <b>rateId</b>, create a \"shipment\" for the package by calling <b>createFromShippingQuote</b>. Creating a shipment completes an agreement, and the cost of the base service and any added shipping options are summed into the returned <b>totalShippingCost</b> value. This action also generates a shipping label that you can use to ship the package.  The total cost of the shipment is incurred when the package is shipped using the supplied shipping label.  <p class=\"tablenote\"><b>Important!</b> Sellers must set up a payment method via their eBay account before they can use the methods in this API to create a shipment and the associated shipping label.</p>",
  "apiTitle": "Logistics API",
  "endpoints": 6,
  "sdkMethods": 6,
  "schemas": 19,
  "parameters": 15,
  "difficultyScore": 19.25,
  "difficulty": "Easy"
}