{
  "providerName": "freesound.org",
  "openApiRaw": "http://miguel76.github.io/freesound-openapi/swagger.json",
  "securitySchemes": {},
  "homepage": "freesound.org",
  "apiVersion": "2.0.0",
  "methods": [
    {
      "url": "/search/text",
      "method": "searchText",
      "httpMethod": "get",
      "tag": "search",
      "description": "Search sounds",
      "parameters": [
        {
          "name": "query",
          "schema": "string",
          "required": false,
          "description": "The query! The query is the main parameter used to define a query. You can type several terms separated by spaces or phrases wrapped inside quote ‘”’ characters. For every term, you can also use ‘+’ and ‘-‘ modifier characters to indicate that a term is “mandatory” or “prohibited” (by default, terms are considered to be “mandatory”). For example, in a query such as query=term_a -term_b, sounds including term_b will not match the search criteria. The query does a weighted search over some sound properties including sound tags, the sound name, its description, pack name and the sound id. Therefore, searching for query=123 will find you sounds with id 1234, sounds that have 1234 in the description, in the tags, etc. You’ll find some examples below. Using an empty query (query= or query=\"\") will return all Freeosund sounds."
        },
        {
          "name": "filter",
          "schema": "string",
          "required": false,
          "description": "Allows filtering query results. See below for more information."
        },
        {
          "name": "sort",
          "schema": "string",
          "required": false,
          "description": "Indicates how query results should be sorted. See below for a list of the sorting options. By default `sort=score`. <p> <table>\n  <tr>\n    <th>Option</th>\n    <th>Explanation</th>\n  </tr>\n  <tr>\n    <td>score</td>\n    <td>Sort by a relevance score returned by our search engine (default).</td>\n  </tr>\n  <tr>\n    <td>duration_desc\n    <td>Sort by the duration of the sounds, longest sounds first.\n  </tr>\n  <tr>\n    <td>duration_asc\n    <td>Same as above, but shortest sounds first.\n  </tr>\n  <tr>\n    <td>created_desc\n    <td>Sort by the date of when the sound was added. newest sounds first.\n  </tr>\n  <tr>\n    <td>created_asc\n    <td>Same as above, but oldest sounds first.\n  </tr>\n  <tr>\n    <td>downloads_desc\n    <td>Sort by the number of downloads, most downloaded sounds first.\n  </tr>\n  <tr>\n    <td>downloads_asc\n    <td>Same as above, but least downloaded sounds first.\n  </tr>\n  <tr>\n    <td>rating_desc\n    <td>Sort by the average rating given to the sounds, highest rated first.\n  </tr>\n  <tr>\n    <td>rating_asc\n    <td>Same as above, but lowest rated sounds first.\n  </tr>\n</table> </p>"
        },
        {
          "name": "groupByPack",
          "schema": "integer",
          "required": false,
          "description": "This parameter represents a boolean option to indicate whether to collapse results belonging to sounds of the same pack into single entries in the results list. If `group_by_pack=1` and search results contain more than one sound that belongs to the same pack, only one sound for each distinct pack is returned (sounds with no packs are returned as well). However, the returned sound will feature two extra properties to access these other sounds omitted from the results list: `n_from_same_pack`: indicates how many other results belong to the same pack (and have not been returned) `more_from_same_pack`: uri pointing to the list of omitted sound results of the same pack (also including the result which has already been returned). See examples below. By default `group_by_pack=0`."
        },
        {
          "name": "page",
          "schema": "integer",
          "required": false,
          "description": "Query results are paginated, this parameter indicates what page should be returned. By default `page=1`."
        },
        {
          "name": "pageSize",
          "schema": "integer",
          "required": false,
          "description": "Indicates the number of sounds per page to include in the result. By default `page_size=15`, and the maximum is `page_size=150`. Not that with bigger `page_size`, more data will need to be transferred."
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": ""
        }
      ]
    },
    {
      "url": "/sounds/{soundId}",
      "method": "getSoundById",
      "httpMethod": "get",
      "tag": "sound",
      "description": "Details of a sound",
      "parameters": [
        {
          "name": "soundId",
          "schema": "integer",
          "required": true,
          "description": "ID of the sound that needs to be fetched"
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": ""
        }
      ]
    }
  ],
  "apiBaseUrl": "http://www.freesound.org/apiv2",
  "apiDescription": "With the Freesound APIv2 you can browse, search, and retrieve information about Freesound users, packs, and the sounds themselves of course. You can find similar sounds to a given target (based on content analysis) and retrieve automatically extracted features from audio files, as well as perform advanced queries combining content analysis features and other metadata (tags, etc...). With the Freesound APIv2, you can also upload, comment, rate and bookmark sounds!",
  "apiTitle": "Freesound",
  "endpoints": 2,
  "sdkMethods": 2,
  "schemas": 1,
  "parameters": 7,
  "contactUrl": "http://groups.google.com/group/freesound-api",
  "difficultyScore": 4.25,
  "difficulty": "Very Easy"
}