{
  "securitySchemes": {
    "BasicAuthentication": {
      "type": "http",
      "scheme": "basic"
    },
    "M2MAuthentication": {
      "type": "http",
      "scheme": "bearer",
      "bearerFormat": "JWT"
    },
    "RemoteAuthentication": {
      "type": "oauth2",
      "flows": {
        "authorizationCode": {
          "authorizationUrl": "https://<your-domain>.procurify.com/oauth/authorize",
          "tokenUrl": "https://<your-domain>.procurify.com/oauth/token",
          "scopes": {}
        }
      }
    },
    "cookieAuth": {
      "type": "apiKey",
      "in": "cookie",
      "name": "sessionid"
    },
    "oauth2": {
      "type": "oauth2",
      "flows": {}
    },
    "tokenAuth": {
      "type": "apiKey",
      "in": "header",
      "name": "Authorization",
      "description": "Token-based authentication with required prefix \"Token\""
    }
  },
  "apiBaseUrl": "https://{user_domain}.procurify.com",
  "apiVersion": "",
  "apiDescription": "\n# Disclaimer\n\n- Procurify’s API is evolving and is subject to change at any time. Additionally, aspects of the API are undocumented, including certain methods, events, and properties. Given that both documented and undocumented aspects of the Procurify API may change at any time, the client relies on the API at their own risk.\n- Client (and/or client’s representative) is responsible for building, testing, and maintaining any API connection between Procurify and any other tool.  Procurify’s responsibility strictly involves providing support on clarifications in regards to the issued API document.\n- Procurify’s API is offered on an “as is” and “as available” basis, without warranties of any kind. By accepting this agreement, you agree that you have read the current API documentation, and accept the API functionality in its current state including current limitations. For questions and clarification around the documentation, please contact support@procurify.com.\n- In accordance with Section 2.(b) of our Subscription Services Agreement, Procurify reserves the right to deny access to our API at any time. If your API requests are too large and time out, contact us immediately to avoid possible suspension of access.\n- You may not attempt to reverse engineer or otherwise derive source code, trade secrets, or know-how in the Procurify API or portion thereof. You may not use the Procurify API to replicate or compete with core products or services offered by Procurify.\n",
  "apiTitle": "Procurify API Documentation",
  "endpoints": 39,
  "sdkMethods": 50,
  "schemas": 237,
  "parameters": 626,
  "originalCustomRequest": {
    "lambda": true
  },
  "customRequestSpecFilename": "procurify.com.yaml",
  "difficultyScore": 325,
  "difficulty": "Hard"
}