{
  "providerName": "mastercard.com",
  "openApiRaw": "https://developer.mastercard.com/devzone/api/portal/swagger/mastercard-repower",
  "homepage": "mastercard.com",
  "serviceName": "Repower",
  "apiVersion": "V2",
  "methods": [
    {
      "url": "/repower/v2/repower",
      "method": "repowerPost2",
      "httpMethod": "post",
      "tag": "rePower Transfer",
      "description": "Mastercard rePower empowers consumers to instantly add money to eligible Mastercard cards. Money is available immediately for expenditures anywhere Mastercard prepaid account is accepted. The ease with which cardholders can convert cash to prepaid card funds turns their reloadable prepaid cards into valuable and practical financial tools. Making the reload process simple and accessible provides merchants with an opportunity to increase cardholder traffic. Unlike other top-up services, merchants have the flexibility to set their own reload fees.  This resource streamlines development efforts to offer Mastercard rePower services, through quick and convenient web services with the following benefits: 1)Savings in development and operational costs associated with implementing a standard MIP connection.  2)Requires support for only a single acquiring interface.  3)Leverages existing processing messages and transaction codes  4)Mastercard provides a net settlement guarantee for each reload transaction  5)Supports EMV, PayPass & MDES transactions.  This resource facilitates the ability for cardholders to reload their prepaid cards easily and securely. \n\n",
      "parameters": [
        {
          "name": "RepowerRequest",
          "schema": "object",
          "description": ""
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": "Response details"
        }
      ]
    },
    {
      "url": "/repower/v2/repowerreversal",
      "method": "repowerReversalPost2",
      "httpMethod": "post",
      "tag": "rePower Transfer Reversal",
      "description": "A Transfer Reversal is a request to reverse a previously submitted Mastercard rePower Transfer, and is only available in extremely limited circumstances.  Reversal Processing : A rePower transaction reversal may be submitted in the event of a documented clerical error. The rePower transaction reversal must be submitted within 15 minutes of the time the original rePower transaction was authorized.  Use this resource to reverse a previously submitted rePower Transfer. ",
      "parameters": [
        {
          "name": "RepowerReversalRequest",
          "schema": "object",
          "description": ""
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": "Response details"
        }
      ]
    }
  ],
  "apiBaseUrl": "https://api.mastercard.com",
  "apiTitle": "rePower",
  "endpoints": 2,
  "sdkMethods": 2,
  "schemas": 18,
  "parameters": 2,
  "difficultyScore": 11.5,
  "difficulty": "Easy"
}