{
  "providerName": "rapidapi.com",
  "openApiRaw": "https://moon-api.com/postman.json",
  "homepage": "rapidapi.com",
  "apiVersion": "1.0.0",
  "apiBaseUrl": "https://moon-phase.p.rapidapi.com",
  "apiDescription": "# Moon-API.com Postman Collection\n\nWelcome to the Moon Phase API Postman Collection! This collection contains a set of pre-configured API requests to interact with the Moon Phase API endpoints provided by [moon-api.com](https://moon-api.com). Explore the enchanting world of the moon and its ever-changing phases with ease using this collection.\n\n## Getting Started\n\nTo start using this Postman collection, follow these steps:\n\n1. [Download and install Postman](https://www.postman.com/downloads/) if you haven't already.\n2. Import the Moon API Postman Collection into your Postman app.\n3. Set your RapidAPI key in the collection's environment variables.\n4. Begin making requests to explore the moon phase data and retrieve lunar information.\n    \n\n## Collection Structure\n\nThe Moon-API.com Postman Collection consists of the following requests:\n\n- **Basic Moon Phase**: Retrieve the main moon phase data.\n- **Advanced Moon Phase**: Get detailed moon phase data based on a specific timezone and coordinates.\n- **Plain Text Moon Phase**: Get a plain text description of the current moon phase.\n- **Emoji Moon Phase**: Get the relevant emoji of the current moon phase.\n- **Lunar Calender**: Get the current year's moon phases in a markdown calender.\n    \n\n## Environment Variables\n\nThe collection uses environment variables to store your RapidAPI key. To use this collection effectively, ensure you set the `X-Rapidapi-Key` variable in the collection's environment with your actual RapidAPI key.\n\n## How to Use\n\n1. Select the desired request from the Moon API collection.\n2. Click on the request to open it.\n3. Send the request and view the response to retrieve the moon phase data.\n    \n\n## Documentation\n\nFor more information on the Moon Phase API endpoints and their response formats, refer to the [official Moon API documentation](https://rapidapi.com/MoonAPIcom/api/moon-phase/details). Visit [moon-api.com](https://moon-api.com) to learn more about the Moon Phase API and the services provided.\n\nHappy moon exploration with the Moon Phase API Postman Collection provided by [moon-api.com](https://moon-api.com)!",
  "apiTitle": "Moon API",
  "endpoints": 5,
  "sdkMethods": 5,
  "schemas": 0,
  "parameters": 7,
  "difficultyScore": 6.75,
  "difficulty": "Very Easy"
}