{
  "providerName": "theracingapi.com",
  "openApiRaw": "https://api.theracingapi.com/openapi.json",
  "homepage": "theracingapi.com",
  "apiVersion": "1.0.0",
  "apiBaseUrl": "https://api.theracingapi.com/",
  "apiDescription": "<h1>Introduction</h1><p>Welcome to <a href='https://www.theracingapi.com' target='_blank'>The Racing API</a>!</p><p>The API is used to access our active database of over 200,000 horse racing results and daily racecards.</p><p>If you dont yet have a  subscription, you can purchase one <a href='https://www.theracingapi.com/#subscribe' target='_blank'>here</a>.</p><p>Requests to the API can be made via any programming language of your choice. Code examples are available in the right column of the documentation.</p><p><b>Any usage is subject to The Racing API <a href='https://www.theracingapi.com/terms-of-service' target='_blank'>terms of service</a>.</b></p><br><br><h1>Base URL</h1><p> The base url for requests is <b>https://api.theracingapi.com</b></p><br><br><h1>Authentication</h1><p>Upon subscribing to The Racing API, you will receive a set of API keys named 'Username' and 'Password' via email.</p><p>In order to authenticate your requests, you should use <b>HTTP Basic Authentication</b>, passing your username and password keys in the <b>Authorization header</b> of your request.</p><p>If your account becomes inactive or you attempt to access endpoints not available to your subscription level, requests will return a <b>401 Unauthorized</b> response.</p><br><br><h1>Rate-Limits</h1><p>Requests are limited to 2 per second for every plan. Exceeding this limit will return a <b>429 Too Many Requests</b> response.</p><br><br><h1>Analysis Endpoints</h1><p>The Racing API analysis endpoints perform data aggregation to return helpful betting & probability insights.</p><p>The statistics returned by these endpoints include:</p><ul><li><b>Win Percentage (win_%):</b> The number of wins divided by total runs/rides for a given query. For example, a win_% figure of 0.18 represents an 18% win percentage.</li><li><b>1 Unit Profit/Loss (1_pl):</b> Profit/loss for total rides/runs for a given query, if a 1 unit stake was placed at SP.</li><li><b>Actual/Expected (a/e):</b> Actual number of wins, divided by expected number of wins for a given query. Expected number of wins is calculated from SP. For a detailed explanation of this statistic, see <a href='https://ratingtheraces.com/blog/information/what-is-the-ae-statistic/#:~:text=A%2FE%20stands%20for%20Actual%20over%20Expected.&text=In%20this%20process%20we%20take,of%201%2F3.0%20%3D%200.33.' target='_blank'>here</a>.</li></ul><p><b>IMPORTANT NOTE:</b> Anaysis endpoints only perform data aggregation on results for which SP odds are available.</p><br><br><p><b>For support or feature requests, please email <a href='mailto:support@theracingapi.com'>support@theracingapi.com</a>.</b></p>",
  "apiTitle": "The Racing API",
  "endpoints": 51,
  "sdkMethods": 51,
  "schemas": 100,
  "parameters": 404,
  "difficultyScore": 202,
  "difficulty": "Hard"
}