{
  "providerName": "whapi.com",
  "openApiRaw": "https://developer.williamhill.com/wh-docs/docs-sdks/numbers/swagger/docs",
  "securitySchemes": {},
  "categories": [
    "entertainment"
  ],
  "homepage": "whapi.com",
  "serviceName": "numbers",
  "apiVersion": "2.0",
  "methods": [
    {
      "url": "/generate/integers",
      "method": "getRandomNumbers",
      "httpMethod": "get",
      "tag": "Numbers",
      "typeScriptTag": "numbers",
      "description": "This method is used to generate random numbers for your app. Within the request, you can specify the lowest number, the highest number and the amount of numbers returned. There is also an option to generate a unique set of numbers with no repetition of the same numbers allowed in the return.",
      "parameters": [
        {
          "name": "apiKey",
          "schema": "string",
          "required": true,
          "description": "A unique identifier of your application that is generated by the API portal and presented in the header."
        },
        {
          "name": "apiSecret",
          "schema": "string",
          "required": true,
          "description": "Another unique identifier for your application. The secret must never be sent over HTTP."
        },
        {
          "name": "apiTicket",
          "schema": "string",
          "required": false,
          "description": "The authentication ticket associated with the user session. The getRandomNumbers method operates in two different ways – ‘Demo’ mode and ‘Live’ mode. In Demo mode, where no money is involved, the ticket is not required and can be used without it. In Live mode, when there is a financial outcome, the developer must supply a valid authentication and the ticket must be supplied. Important: The service should not be used in Live mode without a ticket."
        },
        {
          "name": "gameCode",
          "schema": "string",
          "required": true,
          "description": "Identifier that indicates the game for which the RNG (Random Number Generator) has been used."
        },
        {
          "name": "highest",
          "schema": "integer",
          "required": true,
          "description": "Highest possible value to be returned."
        },
        {
          "name": "lowest",
          "schema": "integer",
          "required": true,
          "description": "Lowest possible value to be returned."
        },
        {
          "name": "count",
          "schema": "integer",
          "required": true,
          "description": "Number of values to be returned."
        },
        {
          "name": "unique",
          "schema": "boolean",
          "required": true,
          "description": "Should the numbers returned be unique"
        }
      ],
      "responses": [
        {
          "statusCode": "200",
          "description": ""
        },
        {
          "statusCode": "400",
          "description": ""
        }
      ]
    }
  ],
  "apiBaseUrl": "https://sandbox.whapi.com/v2/numbers",
  "apiDescription": "The William Hill Numbers API uses a single method that allows you to generate random numbers for your application. Numbers can either be unique or can be produced with the chance that some might be the same. For example, you can have a highest value of 6 and a lowest value of 1 with a count of 2 with a unique value of false - this will give you two numbers between 1 and 6 which are independent, just like two dice being rolled.<br /><br />The Numbers API is a Private API and therefore not automatically available to developers. To use this API, contact your business manager who will guide you through the separate Terms and Conditions of use before you can have the API assigned to your application.",
  "apiTitle": "Numbers API",
  "endpoints": 1,
  "sdkMethods": 1,
  "schemas": 3,
  "parameters": 8,
  "difficultyScore": 4.5,
  "difficulty": "Very Easy"
}