{
  "Customer.io is a versatile marketing automation tool for sending relevant messages based on behavior across web and mobile products. \n\nImpersonal messages lead to bad experiences. That's why we use real-time data to help you deliver the right message, exactly when it's needed — like sending an event reminder over SMS or the perfect onboarding email.\n\nOur robust platform enables you to:\n- Automate your product messaging, with the ability to build, test, and send messages from one platform. \n- Create and manage newsletters, transactional messages, and behavioral messages \n- Do more with your behavior and data -- connect our powerful segmentation and automation engine with other apps to drive user behavior and save time. \n\nLearn more: https://customer.io": "Customer.io is a versatile marketing automation tool that sends relevant messages based on user behavior across web and mobile. Real-time data ensures personalized messaging, from event reminders to onboarding emails. Automate product messaging, newsletters, and more with powerful segmentation and automation capabilities.",
  "Customer.io is a versatile marketing automation tool for sending relevant messages based on behavior across web and mobile products.\n\nImpersonal messages lead to bad experiences. That's why we use real-time data to help you deliver the right message, exactly when it's needed — like sending an event reminder over SMS or the perfect onboarding email.\n\nOur robust platform enables you to:\n- Automate your product messaging, with the ability to build, test, and send messages from one platform.\n- Create and manage newsletters, transactional messages, and behavioral messages\n- Do more with your behavior and data -- connect our powerful segmentation and automation engine with other apps to drive user behavior and save time.\n\nLearn more: https://customer.io": "Customer.io is a versatile marketing automation tool using real-time data to deliver the right message at the right time. Automate product messaging, create newsletters, and connect with other apps to drive user behavior efficiently. Customer.io's {language} SDK for Journeys Track API generated by Konfig (https://konfigthis.com/)."
}
