{
  "A Plug agora é Malga! \nMais do que uma plataforma de pagamentos, queremos ser uma comunidade que empodera negócios digitais. A única e última plataforma de integração de pagamentos.\nCom tecnologia agnóstica, adaptável e resiliente. Desenvolvendo as melhores experiências para empresas, desenvolvedores e consumidores. Simplificando o que é complexo e evoluindo todos os dias.\nSomos uma startup apoiada por investidores focados em tecnologia com a missão de ajudar empresas digitais a descobrirem todo o potencial de pagamentos. Fomos acelerados pela Y Combinator, fundada em 2005 no Vale do Silício (EUA) e considerada a maior aceleradora de tecnologia do mundo. Por isso, temos muito orgulho de colocar em nosso nome essa sigla pequena, mas com tanto significado: YC S21.": "Malga (formerly Plug) is more than a payment platform. We empower digital businesses with cutting-edge, adaptable technology. Supported by Y Combinator, we simplify complexity and evolve daily to unlock the full potential of digital payments. Malga's {language} SDK generated by Konfig (https://konfigthis.com/).",
  "A Plug agora é Malga!\nMais do que uma plataforma de pagamentos, queremos ser uma comunidade que empodera negócios digitais. A única e última plataforma de integração de pagamentos.\nCom tecnologia agnóstica, adaptável e resiliente. Desenvolvendo as melhores experiências para empresas, desenvolvedores e consumidores. Simplificando o que é complexo e evoluindo todos os dias.\nSomos uma startup apoiada por investidores focados em tecnologia com a missão de ajudar empresas digitais a descobrirem todo o potencial de pagamentos. Fomos acelerados pela Y Combinator, fundada em 2005 no Vale do Silício (EUA) e considerada a maior aceleradora de tecnologia do mundo. Por isso, temos muito orgulho de colocar em nosso nome essa sigla pequena, mas com tanto significado: YC S21.": "Malga, a plataforma de pagamentos que potencializa negócios digitais com tecnologia agnóstica, simplificação e evolução diária. Startup apoiada pela Y Combinator, aceleradora de tecnologia renomada. Nome inspirado em sua jornada de sucesso: YC S21. Malga's {language} SDK generated by Konfig (https://konfigthis.com/)."
}