{
  "Tribepad is the trusted tech ally to smart(er) recruiters everywhere, designed to help you fall back in love with recruiting. Our simple, flexible talent acquisition platform takes your recruitment headaches away - giving power to the people finders.\n\nCombining ATS, CRM, Video Interviewing, and Onboarding plus a strong integration ecosystem and a switched-on, passionate team cheering you on, our tech is a springboard for faster, fairer, better hiring. \n\nTrusted by organisations like the Tesco, NHS Professionals, KFC, Subway, Sodexo, G4S and Local Authorities across the UK, 25 million people in 16 languages use Tribepad. \n\nCast-iron security with G-Cloud 12 approved suppliers and data stored in ISO27001-compliant UK data centres.": "Tribepad: Your trusted tech ally for recruiting. Simple, flexible talent acquisition platform with ATS, CRM, Video Interviewing, and Onboarding. Used by organizations like Tesco, NHS, KFC. Cast-iron security with G-Cloud 12 approval. Tribepad's {language} SDK generated by Konfig (https://konfigthis.com/).",
  "Tribepad is the trusted tech ally to smart(er) recruiters everywhere, designed to help you fall back in love with recruiting. Our simple, flexible talent acquisition platform takes your recruitment headaches away - giving power to the people finders.\n\nCombining ATS, CRM, Video Interviewing, and Onboarding plus a strong integration ecosystem and a switched-on, passionate team cheering you on, our tech is a springboard for faster, fairer, better hiring.\n\nTrusted by organisations like the Tesco, NHS Professionals, KFC, Subway, Sodexo, G4S and Local Authorities across the UK, 25 million people in 16 languages use Tribepad.\n\nCast-iron security with G-Cloud 12 approved suppliers and data stored in ISO27001-compliant UK data centres.": "Tribepad is a trusted tech ally for recruiters, offering a simple, flexible talent acquisition platform with ATS, CRM, Video Interviewing, and Onboarding. Trusted by top organizations in the UK and with cast-iron security. Tribepad's {language} SDK generated by Konfig (https://konfigthis.com/)."
}