{
  "Visier is the people impact platform that puts the right insights in the right hands, at the right time, throughout the business. \n\nWe help organizations of all sizes unlock the power of their people data for business impact. This includes enterprises using our category-leading people analytics software, partners embedding our solution into existing apps, and developers building on the Visier platform.\n\nAs the global leader in people analytics, Visier has over 25,000 customers in 75 countries around the world, including enterprises like BASF, Bridgestone, Electronic Arts, McKesson, MerckKGaA, and more. Visier is headquartered in Vancouver, BC with offices and team members worldwide.": "Visier is a global leader in people analytics, empowering organizations with data-driven insights for business impact. With over 25,000 customers in 75 countries, Visier provides category-leading software to enterprises, partners, and developers worldwide.",
  "Visier is the people impact platform that puts the right insights in the right hands, at the right time, throughout the business.\n\nWe help organizations of all sizes unlock the power of their people data for business impact. This includes enterprises using our category-leading people analytics software, partners embedding our solution into existing apps, and developers building on the Visier platform.\n\nAs the global leader in people analytics, Visier has over 25,000 customers in 75 countries around the world, including enterprises like BASF, Bridgestone, Electronic Arts, McKesson, MerckKGaA, and more. Visier is headquartered in Vancouver, BC with offices and team members worldwide.": "Visier is a global people analytics leader, empowering organizations to leverage their data for business impact. With over 25,000 customers in 75 countries, Visier offers category-leading software for enterprises, partners, and developers worldwide. Visier's {language} SDK for PermissionManagement API generated by Konfig (https://konfigthis.com/)."
}