{
  "Wannme es una plataforma de pagos que gestiona todo el proceso del cobro, desde la pasarela de pago hasta las comunicaciones de tu tienda física u online. ¿Cómo lo hacemos? Mediante una única solución, una sola API. \n¿Qué te ofrecemos? Una solución personalizada para ti y tu negocio, con múltiples funcionalidades que puedes combinar libremente, fácil de integrar, usar y sin sobrecostes. Todo y más a golpe de clic. \nQueremos ser tu partner tecnológico y acompañarte en todo el proceso de cobro a tus clientes. Con la misma tecnología y procesos que usan los grandes, pero adaptada a lo que necesites (tarjeta de crédito, Bizum, efectivo, Split Payments, pagos PSD2… etc.) para que tú te centres en vender y tus clientes en comprar.\nDo you want me?": "Wannme: plataforma de pagos completa, fácil de usar y personalizable. Única API para gestionar todo el proceso de cobro. Facilita pagos online y en tiendas físicas. Tecnología adaptada a tus necesidades. Simplifica tus transacciones sin costes adicionales. WANNME's {language} SDK generated by Konfig (https://konfigthis.com/).",
  "Wannme es una plataforma de pagos que gestiona todo el proceso del cobro, desde la pasarela de pago hasta las comunicaciones de tu tienda física u online. ¿Cómo lo hacemos? Mediante una única solución, una sola API.\n¿Qué te ofrecemos? Una solución personalizada para ti y tu negocio, con múltiples funcionalidades que puedes combinar libremente, fácil de integrar, usar y sin sobrecostes. Todo y más a golpe de clic.\nQueremos ser tu partner tecnológico y acompañarte en todo el proceso de cobro a tus clientes. Con la misma tecnología y procesos que usan los grandes, pero adaptada a lo que necesites (tarjeta de crédito, Bizum, efectivo, Split Payments, pagos PSD2… etc.) para que tú te centres en vender y tus clientes en comprar.\nDo you want me?": "Wannme offers a payment platform with a single API, customizable solutions, and multiple payment options like credit cards, Bizum, cash, Split Payments, PSD2 compliance. Simplify your payment process and focus on selling. WANNME's {language} SDK generated by Konfig (https://konfigthis.com/)."
}